/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   printbyte.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tzenz <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/15 10:32:23 by tzenz             #+#    #+#             */
/*   Updated: 2020/02/15 10:32:24 by tzenz            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

void 			    ft_putbyte(intmax_t sign, uintmax_t unsing)
{
	unsigned char   bt[8] = {0};
	unsigned char   i, j, k;
	char            str_tmp[9] = {};

    if (sign >= -2147483648 && sign <= 2147483647 && unsing < 4294967295)
    {
        for (j = 0; j < 4; j++) //счетчк байт		                        //int состоит из 4 байт (32бит) (3,2,1,0 байт) (0000 0000  0000 0000  0000 0000  0000 0001) - 1
        {                       						                    //этот цикл в каждой итерации сдвигает биты >> на 8 бит и записывает их в массив чаров
            if ((((!sign) ? unsing : sign >> j * 8) == 0) && (j > 0)) break;	//что бы не выводить лишних нулей
            bt[j] = (unsigned char) ((!sign) ? unsing : sign >> j * 8); 		//и побайтно записывает результат каждую ячейку массива
        }
        if (j == 1)
            ft_putstr("00000000 | 00000000 | 00000000 | ");
        else if (j == 2)
            ft_putstr("00000000 | 00000000 | ");
        else if (j == 3)
            ft_putstr("00000000 | ");
        for (k = 0; k < j; k++)
        {
            for (i = 0; i < 8; i++)
            {
                switch ((bt[j - k - 1] >> i) & 0b00000001) //c
                {
                    case 1: str_tmp[7 - i] = '1'; break;
                    case 0: str_tmp[7 - i] = '0'; break;
                }
            }
            ft_putstr(str_tmp);
            if (k + 1 != j)
                ft_putstr(" | ");
        }
    }
    else
    {
        for (j = 0; j < 8; j++) //счетчк байт			                    //long состоит из 8 байт (64бит)
        {                       						                    //этот цикл в каждой итерации сдвигает биты >> на 8 бит и записывает их в массив чаров
            if ((((!sign) ? unsing : sign >> j * 8) == 0) && (j > 0)) break;	//что бы не выводить лишних нулей
            bt[j] = (unsigned char) ((!sign) ? unsing : sign >> j * 8); 		//и побайтно записывает результат каждую ячейку массива
        }
        if (j == 1)
            ft_putstr("00000000 | 00000000 | 00000000 | 00000000 | 00000000 | 00000000 | 00000000 | ");
        else if (j == 2)
            ft_putstr("00000000 | 00000000 | 00000000 | 00000000 | 00000000 | 00000000 | ");
        else if (j == 3)
            ft_putstr("00000000 | 00000000 | 00000000 | 00000000 | 00000000 | ");
        else if (j == 4)
            ft_putstr("00000000 | 00000000 | 00000000 | 00000000 | ");
        else if (j == 5)
            ft_putstr("00000000 | 00000000 | 00000000 | ");
        else if (j == 6)
            ft_putstr("00000000 | 00000000 | ");
        else if (j == 7)
            ft_putstr("00000000 | ");
        for (k = 0; k < j; k++)
        {
            for (i = 0; i < 8; i++)
            {
                switch ((bt[j - k - 1] >> i) & 0b00000001) //c
                {
                    case 1: str_tmp[7 - i] = '1'; break;
                    case 0: str_tmp[7 - i] = '0'; break;
                }
            }
            ft_putstr(str_tmp);
            if (k + 1 != j)
                ft_putstr(" | ");
        }
    }
}